# Agregación de datos por categoría

In [48]:
import numpy as np
import pandas as pd

In [49]:
genero = ["Hombre", "Mujer"]
estatus = ["Bajos", "Clase Media", "Rico"]

In [50]:
n = 500

genero_data = []
estatus_data = []

for i in range(0,n):
    genero_data.append(np.random.choice(genero))
    estatus_data.append(np.random.choice(estatus))

In [51]:
genero_data[1:10]

['Hombre',
 'Hombre',
 'Mujer',
 'Mujer',
 'Hombre',
 'Hombre',
 'Mujer',
 'Mujer',
 'Hombre']

In [52]:
estatus_data[1:10]

['Clase Media',
 'Rico',
 'Rico',
 'Rico',
 'Clase Media',
 'Clase Media',
 'Clase Media',
 'Bajos',
 'Bajos']

In [61]:
altura_data = 160 + 30*np.random.randn(n)
altura_data = abs(altura_data.round(2))
peso_data = 65 + 25*np.random.randn(n)
peso_data = abs(peso_data.round(2))
edad_data = 30 + 12*np.random.randn(n)
edad_data = abs(edad_data.astype(int))
ingresos_data = 18000 + 3500*np.random.randn(n)
ingresos_data = abs(ingresos_data.astype(int))

In [62]:
data = pd.DataFrame(
    {
        "Genero": genero_data,
        "Estatus": estatus_data,
        "Altura": altura_data,
        "Peso": peso_data,
        "Edad": edad_data,
        "Ingresos" : ingresos_data 
    }
)

In [65]:
data.head()

   Genero      Estatus  Altura    Peso  Edad  Ingresos
0  Hombre        Bajos  160.65   77.31    19     20110
1  Hombre  Clase Media  125.39  102.32    26     20933
2  Hombre         Rico  107.52   45.24    56     18446
3   Mujer         Rico   88.84   58.95    31     14821
4   Mujer         Rico  127.74   86.75    22     19025

In [66]:
data.describe()

           Altura        Peso        Edad      Ingresos
count  500.000000  500.000000  500.000000    500.000000
mean   160.107860   66.736820   28.930000  17791.186000
std     30.409798   25.751003   11.695069   3381.065559
min     62.280000    1.090000    1.000000   7988.000000
25%    140.095000   48.597500   21.000000  15399.500000
50%    160.510000   67.525000   29.000000  17895.500000
75%    179.805000   83.537500   36.000000  20321.250000
max    262.640000  165.070000   65.000000  26533.000000

## Agrupación de datos

In [68]:
genero_agrupado = data.groupby("Genero")
genero_agrupado.groups

{'Hombre': [0, 1, 2, 5, 6, 9, 17, 18, 19, 20, 21, 22, 24, 28, 29, 31, 32, 33, 35, 36, 38, 40, 42, 44, 45, 46, 50, 51, 52, 53, 57, 58, 59, 60, 61, 63, 64, 66, 69, 70, 71, 78, 79, 80, 81, 86, 88, 90, 92, 93, 94, 95, 96, 102, 103, 104, 105, 108, 110, 111, 112, 116, 117, 118, 119, 123, 124, 126, 128, 129, 130, 131, 133, 135, 136, 142, 147, 150, 152, 153, 155, 157, 160, 162, 163, 164, 165, 167, 169, 170, 171, 172, 173, 174, 179, 180, 186, 187, 189, 191, ...], 'Mujer': [3, 4, 7, 8, 10, 11, 12, 13, 14, 15, 16, 23, 25, 26, 27, 30, 34, 37, 39, 41, 43, 47, 48, 49, 54, 55, 56, 62, 65, 67, 68, 72, 73, 74, 75, 76, 77, 82, 83, 84, 85, 87, 89, 91, 97, 98, 99, 100, 101, 106, 107, 109, 113, 114, 115, 120, 121, 122, 125, 127, 132, 134, 137, 138, 139, 140, 141, 143, 144, 145, 146, 148, 149, 151, 154, 156, 158, 159, 161, 166, 168, 175, 176, 177, 178, 181, 182, 183, 184, 185, 188, 190, 194, 197, 200, 203, 208, 210, 212, 213, ...]}

In [72]:
for nombres,grupos in genero_agrupado:
    print(nombres)
    print(grupos)

Hombre
     Genero      Estatus  Altura    Peso  Edad  Ingresos
0    Hombre        Bajos  160.65   77.31    19     20110
1    Hombre  Clase Media  125.39  102.32    26     20933
2    Hombre         Rico  107.52   45.24    56     18446
5    Hombre  Clase Media  148.87   72.32    25     20823
6    Hombre  Clase Media  138.29   19.61    42     16807
..      ...          ...     ...     ...   ...       ...
487  Hombre        Bajos  167.39   99.22    19     15379
490  Hombre  Clase Media  158.47   63.53    33     19812
492  Hombre  Clase Media  168.25   88.94    30     15360
493  Hombre        Bajos  202.73   47.45    18     15666
498  Hombre         Rico  177.79   63.11    35     22149

[255 rows x 6 columns]
Mujer
    Genero      Estatus  Altura    Peso  Edad  Ingresos
3    Mujer         Rico   88.84   58.95    31     14821
4    Mujer         Rico  127.74   86.75    22     19025
7    Mujer  Clase Media  147.52   36.09    42     20811
8    Mujer        Bajos  205.85   67.95    24     19489
10   Mujer        Bajos  203.78  119.39    18     18528
..     ...          ...     ...     ...   ...       ...
494  Mujer         Rico  178.06   72.37    19     13169
495  Mujer         Rico  170.70   73.11    42     15912
496  Mujer  Clase Media  131.34  119.32    30     14053
497  Mujer  Clase Media  152.44   46.22    16     21405
499  Mujer        Bajos  174.55   65.95    20     19628

[245 rows x 6 columns]

In [74]:
genero_agrupado.get_group("Mujer")

    Genero      Estatus  Altura    Peso  Edad  Ingresos
3    Mujer         Rico   88.84   58.95    31     14821
4    Mujer         Rico  127.74   86.75    22     19025
7    Mujer  Clase Media  147.52   36.09    42     20811
8    Mujer        Bajos  205.85   67.95    24     19489
10   Mujer        Bajos  203.78  119.39    18     18528
..     ...          ...     ...     ...   ...       ...
494  Mujer         Rico  178.06   72.37    19     13169
495  Mujer         Rico  170.70   73.11    42     15912
496  Mujer  Clase Media  131.34  119.32    30     14053
497  Mujer  Clase Media  152.44   46.22    16     21405
499  Mujer        Bajos  174.55   65.95    20     19628

[245 rows x 6 columns]

In [76]:
doble_agrupacion = data.groupby(["Genero", "Estatus"])

In [78]:
for nombres,grupos in doble_agrupacion:
    print(nombres)
    print(grupos)

('Hombre', 'Bajos')
     Genero Estatus  Altura   Peso  Edad  Ingresos
0    Hombre   Bajos  160.65  77.31    19     20110
9    Hombre   Bajos  177.95  94.07    34     15441
18   Hombre   Bajos  153.39  74.27    26     21257
20   Hombre   Bajos  170.28  67.41    30     16366
21   Hombre   Bajos  178.06  72.13    21     11168
..      ...     ...     ...    ...   ...       ...
476  Hombre   Bajos  127.99  77.51    50     18431
479  Hombre   Bajos  144.66  93.13    41     19205
486  Hombre   Bajos  169.68  72.84    22     16127
487  Hombre   Bajos  167.39  99.22    19     15379
493  Hombre   Bajos  202.73  47.45    18     15666

[86 rows x 6 columns]
('Hombre', 'Clase Media')
     Genero      Estatus  Altura    Peso  Edad  Ingresos
1    Hombre  Clase Media  125.39  102.32    26     20933
5    Hombre  Clase Media  148.87   72.32    25     20823
6    Hombre  Clase Media  138.29   19.61    42     16807
17   Hombre  Clase Media  122.62   64.20    14     15358
28   Hombre  Clase Media  174.42   75.72    25     13044
..      ...          ...     ...     ...   ...       ...
460  Hombre  Clase Media  107.28   75.66    53     23952
474  Hombre  Clase Media  144.20  105.83    19     17646
484  Hombre  Clase Media  206.92   49.38    36     20290
490  Hombre  Clase Media  158.47   63.53    33     19812
492  Hombre  Clase Media  168.25   88.94    30     15360

[77 rows x 6 columns]
('Hombre', 'Rico')
     Genero Estatus  Altura   Peso  Edad  Ingresos
2    Hombre    Rico  107.52  45.24    56     18446
19   Hombre    Rico  164.75  41.16    19     18390
24   Hombre    Rico  111.04  72.60    30     22330
33   Hombre    Rico  170.40  80.66    18     20325
51   Hombre    Rico  190.06  71.65    13     17444
..      ...     ...     ...    ...   ...       ...
472  Hombre    Rico  126.42  54.15    21     16050
473  Hombre    Rico  146.73  93.87     6     16226
477  Hombre    Rico  142.05  83.01    27     14522
480  Hombre    Rico  138.86  33.36    20     18313
498  Hombre    Rico  177.79  63.11    35     22149

[92 rows x 6 columns]
('Mujer', 'Bajos')
    Genero Estatus  Altura    Peso  Edad  Ingresos
8    Mujer   Bajos  205.85   67.95    24     19489
10   Mujer   Bajos  203.78  119.39    18     18528
13   Mujer   Bajos  166.77   69.99    26     23717
25   Mujer   Bajos  157.69   98.13    23     13130
26   Mujer   Bajos  180.09   71.64    42     14043
..     ...     ...     ...     ...   ...       ...
470  Mujer   Bajos  180.02   64.72    38     13432
475  Mujer   Bajos  183.14  104.49    45     19985
488  Mujer   Bajos  258.43   75.60    28     20570
491  Mujer   Bajos  191.83   16.35    19     14591
499  Mujer   Bajos  174.55   65.95    20     19628

[67 rows x 6 columns]
('Mujer', 'Clase Media')
    Genero      Estatus  Altura    Peso  Edad  Ingresos
7    Mujer  Clase Media  147.52   36.09    42     20811
11   Mujer  Clase Media  168.54   73.67    16     18858
12   Mujer  Clase Media  112.59   51.33    31     19340
14   Mujer  Clase Media  178.93   56.54    22     20281
23   Mujer  Clase Media  120.13   30.99    26     21318
..     ...          ...     ...     ...   ...       ...
466  Mujer  Clase Media  262.64  110.38    22     16299
478  Mujer  Clase Media  185.04   51.04    18     18860
482  Mujer  Clase Media  188.52   54.38    20     21771
496  Mujer  Clase Media  131.34  119.32    30     14053
497  Mujer  Clase Media  152.44   46.22    16     21405

[88 rows x 6 columns]
('Mujer', 'Rico')
    Genero Estatus  Altura   Peso  Edad  Ingresos
3    Mujer    Rico   88.84  58.95    31     14821
4    Mujer    Rico  127.74  86.75    22     19025
15   Mujer    Rico  142.46  61.15    19     23405
16   Mujer    Rico  166.70  12.22    41     18161
39   Mujer    Rico  173.90  86.66    30     21659
..     ...     ...     ...    ...   ...       ...
483  Mujer    Rico  177.92  57.27    52     19899
485  Mujer    Rico  140.74  14.36    43     21164
489  Mujer    Rico  175.18  82.06    31     16119
494  Mujer    Rico  178.06  72.37    19     13169
495  Mujer    Rico  170.70  73.11    42     15912

[90 rows x 6 columns]

In [81]:
doble_agrupacion.get_group(('Hombre', 'Bajos'))

     Genero Estatus  Altura   Peso  Edad  Ingresos
0    Hombre   Bajos  160.65  77.31    19     20110
9    Hombre   Bajos  177.95  94.07    34     15441
18   Hombre   Bajos  153.39  74.27    26     21257
20   Hombre   Bajos  170.28  67.41    30     16366
21   Hombre   Bajos  178.06  72.13    21     11168
..      ...     ...     ...    ...   ...       ...
476  Hombre   Bajos  127.99  77.51    50     18431
479  Hombre   Bajos  144.66  93.13    41     19205
486  Hombre   Bajos  169.68  72.84    22     16127
487  Hombre   Bajos  167.39  99.22    19     15379
493  Hombre   Bajos  202.73  47.45    18     15666

[86 rows x 6 columns]

## Operaciones sobre datos agrupados

In [82]:
doble_agrupacion.sum()

                      Altura     Peso  Edad  Ingresos
Genero Estatus
Hombre Bajos        13884.18  5870.76  2609   1537468
       Clase Media  12206.55  4948.99  2275   1324039
       Rico         14540.55  5994.61  2593   1589606
Mujer  Bajos        11027.76  4721.52  1870   1216921
       Clase Media  14423.40  5876.15  2506   1615816
       Rico         13971.49  5956.38  2612   1611743

In [83]:
doble_agrupacion.mean()

                        Altura       Peso       Edad      Ingresos
Genero Estatus
Hombre Bajos        161.443953  68.264651  30.337209  17877.534884
       Clase Media  158.526623  64.272597  29.545455  17195.311688
       Rico         158.049457  65.158804  28.184783  17278.326087
Mujer  Bajos        164.593433  70.470448  27.910448  18163.000000
       Clase Media  163.902273  66.774432  28.477273  18361.545455
       Rico         155.238778  66.182000  29.022222  17908.255556

In [84]:
doble_agrupacion.size()

Genero  Estatus
Hombre  Bajos          86
        Clase Media    77
        Rico           92
Mujer   Bajos          67
        Clase Media    88
        Rico           90
dtype: int64

In [85]:
doble_agrupacion.describe()

                   Altura                                                    \
                    count        mean        std     min       25%      50%
Genero Estatus
Hombre Bajos         86.0  161.443953  26.203045   89.85  145.0125  161.985
       Clase Media   77.0  158.526623  32.742470   86.18  135.4000  159.230
       Rico          92.0  158.049457  31.702573   75.34  136.9150  159.515
Mujer  Bajos         67.0  164.593433  32.186213   62.28  146.1050  166.770
       Clase Media   88.0  163.902273  30.939950  108.86  142.1200  155.700
       Rico          90.0  155.238778  28.642350   88.84  135.3725  157.795

                                      Peso             ...   Edad        \
                         75%     max count       mean  ...    75%   max
Genero Estatus                                         ...
Hombre Bajos        179.7450  211.69  86.0  68.264651  ...  39.75  65.0
       Clase Media  178.1700  246.59  77.0  64.272597  ...  36.00  55.0
       Rico         179.6575  226.29  92.0  65.158804  ...  35.00  60.0
Mujer  Bajos        183.5900  258.43  67.0  70.470448  ...  36.00  51.0
       Clase Media  186.5475  262.64  88.0  66.774432  ...  36.00  56.0
       Rico         174.8225  222.33  90.0  66.182000  ...  37.00  54.0

                   Ingresos                                                \
                      count          mean          std      min       25%
Genero Estatus
Hombre Bajos           86.0  17877.534884  3656.094785  10901.0  15414.00
       Clase Media     77.0  17195.311688  3265.332760  10167.0  15158.00
       Rico            92.0  17278.326087  3158.492150   8543.0  15090.50
Mujer  Bajos           67.0  18163.000000  3249.594567  11721.0  15506.00
       Clase Media     88.0  18361.545455  3203.325527  12325.0  16226.25
       Rico            90.0  17908.255556  3624.234390   7988.0  15165.25


                        50%       75%      max
Genero Estatus
Hombre Bajos        17850.0  20481.25  26154.0
       Clase Media  17392.0  19356.00  26533.0
       Rico         17384.0  19919.75  22965.0
Mujer  Bajos        18331.0  20430.00  24492.0
       Clase Media  18067.0  20816.75  26368.0
       Rico         18076.5  20583.75  25970.0

[6 rows x 32 columns]

In [86]:
doble_agrupacion_ingresos = doble_agrupacion["Ingresos"]

In [87]:
doble_agrupacion_ingresos.describe()

                    count          mean          std      min       25%  \
Genero Estatus
Hombre Bajos         86.0  17877.534884  3656.094785  10901.0  15414.00
       Clase Media   77.0  17195.311688  3265.332760  10167.0  15158.00
       Rico          92.0  17278.326087  3158.492150   8543.0  15090.50
Mujer  Bajos         67.0  18163.000000  3249.594567  11721.0  15506.00
       Clase Media   88.0  18361.545455  3203.325527  12325.0  16226.25
       Rico          90.0  17908.255556  3624.234390   7988.0  15165.25

                        50%       75%      max
Genero Estatus
Hombre Bajos        17850.0  20481.25  26154.0
       Clase Media  17392.0  19356.00  26533.0
       Rico         17384.0  19919.75  22965.0
Mujer  Bajos        18331.0  20430.00  24492.0
       Clase Media  18067.0  20816.75  26368.0
       Rico         18076.5  20583.75  25970.0

In [89]:
doble_agrupacion.aggregate(
    {
        "Ingresos": np.sum,
        "Edad": np.mean,
        "Altura": np.std
    }
)

                    Ingresos       Edad     Altura
Genero Estatus
Hombre Bajos         1537468  30.337209  26.203045
       Clase Media   1324039  29.545455  32.742470
       Rico          1589606  28.184783  31.702573
Mujer  Bajos         1216921  27.910448  32.186213
       Clase Media   1615816  28.477273  30.939950
       Rico          1611743  29.022222  28.642350

In [93]:
doble_agrupacion.aggregate(
    {
        "Edad": np.mean,
        "Altura": lambda a: np.mean(a)/np.std(a)
    }
)

                         Edad    Altura
Genero Estatus
Hombre Bajos        30.337209  6.197404
       Clase Media  29.545455  4.873369
       Rico         28.184783  5.012700
Mujer  Bajos        27.910448  5.152382
       Clase Media  28.477273  5.327790
       Rico         29.022222  5.450268

In [94]:
doble_agrupacion.aggregate([np.sum,np.mean,np.std])

                      Altura                            Peso             \
                         sum        mean        std      sum       mean
Genero Estatus
Hombre Bajos        13884.18  161.443953  26.203045  5870.76  68.264651
       Clase Media  12206.55  158.526623  32.742470  4948.99  64.272597
       Rico         14540.55  158.049457  31.702573  5994.61  65.158804
Mujer  Bajos        11027.76  164.593433  32.186213  4721.52  70.470448
       Clase Media  14423.40  163.902273  30.939950  5876.15  66.774432
       Rico         13971.49  155.238778  28.642350  5956.38  66.182000

                               Edad                       Ingresos  \
                          std   sum       mean        std      sum
Genero Estatus
Hombre Bajos        26.465467  2609  30.337209  12.982894  1537468
       Clase Media  24.126868  2275  29.545455  10.592382  1324039
       Rico         26.376028  2593  28.184783  11.748209  1589606
Mujer  Bajos        24.489134  1870  27.910448  12.029927  1216921
       Clase Media  25.307533  2506  28.477273  11.197267  1615816
       Rico         27.365264  2612  29.022222  11.630044  1611743


                            mean          std
Genero Estatus
Hombre Bajos        17877.534884  3656.094785
       Clase Media  17195.311688  3265.332760
       Rico         17278.326087  3158.492150
Mujer  Bajos        18163.000000  3249.594567
       Clase Media  18361.545455  3203.325527
       Rico         17908.255556  3624.234390

In [96]:
doble_agrupacion.aggregate([lambda x: np.mean(x)/np.std(x)])

                      Altura      Peso      Edad  Ingresos
                    <lambda>  <lambda>  <lambda>  <lambda>
Genero Estatus
Hombre Bajos        6.197404  2.594514  2.350411  4.918469
       Clase Media  4.873369  2.681412  2.807602  5.300553
       Rico         5.012700  2.483916  2.412216  5.500410
Mujer  Bajos        5.152382  2.899339  2.337595  5.631497
       Clase Media  5.327790  2.653641  2.557809  5.764875
       Rico         5.450268  2.432016  2.509433  4.968934